DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
/**********************************************************************************************
    Copyright © 2019 Digital Confections LLC

    Permission is hereby granted, free of charge, to any person obtaining a copy of
    this software and associated documentation files (the "Software"), to deal in the
    Software without restriction, including without limitation the rights to use, copy,
    modify, merge, publish, distribute, sublicense, and/or sell copies of the Software,
    and to permit persons to whom the Software is furnished to do so, subject to the
    following conditions:

    The above copyright notice and this permission notice shall be included in all
    copies or substantial portions of the Software.

    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
    INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
    PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE
    FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
    OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
    DEALINGS IN THE SOFTWARE.

**********************************************************************************************/
#include "Event.h"
#include <LittleFS.h>
#include "Helpers.h"
#include <ESP8266WebServer.h>
#include <WebSocketsServer.h>

extern ESP8266WebServer * g_http_server;

Event::Event(bool debug)
{

#ifdef EVENT_DEBUG_PRINTS_OVERRIDE
  debug = EVENT_DEBUG_PRINTS_OVERRIDE;
#endif
  debug_prints_enabled = debug;

  values_did_change = false;
  eventData = new EventDataStruct();

  for (int i = 0; i < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES; i++)
  {
    eventData->role[i] = new RoleDataStruct();
    if (eventData->role[i] == NULL)
    {
      Serial.println("Error! Out of memory?");
    }

    for (int j = 0; j < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE; j++)
    {
      eventData->role[i]->tx[j] = new TxDataStruct();

      if (eventData->role[i]->tx[j] == NULL)
      {
        Serial.println("Error! Out of memory?");
      }
    }
  }
}

Event::~Event()
{

  for (int i = 0; i < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES; i++)
  {
    for (int j = 0; j < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE; j++)
    {
      delete eventData->role[i]->tx[j];
    }

    delete eventData->role[i];
  }

  delete eventData;
}

bool Event::extractLineData(String s, EventLineData *result)
{
  if (s.indexOf(',') < 0)
  {
    if ((s.indexOf("EVENT_START") < 0) && (s.indexOf("EVENT_END") < 0))
    {
      return ( true); /* invalid line found */
    }
    else
    {
      result->id = "";
      result->value = s;
      return ( false); /* start or end found */
    }
  }

  String settingID = s.substring(0, s.indexOf(','));
  String value = s.substring(s.indexOf(',') + 1);
  value.trim();                   /*remove leading and trailing whitespace */

  if (value.charAt(0) == '"')
  {
    if (value.charAt(1) == '"') /* handle empty string */
    {
      value = "";
    }
    else                        /* remove quotes */
    {
      value = value.substring(1, value.length() - 1);
    }
  }

  result->id = settingID;
  result->value = value;

  return ( false);
}

bool Event::parseStringData(String s)
{
  EventLineData data;

  if (extractLineData(s, &data))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Error extracting data");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    return ( true); /* flag error */
  }
  else if ((data.id).equals(""))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("No data found");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    return ( false); /* no data but no error */
  }

#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println(String("Parsed: ") + s + " = " + data.id + " " + data.value);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
  return (setEventData(data.id, data.value));
}

/**
    Returns a boolean indicating if event a will commence sooner that b relative to the currentEpoch
*/
bool Event::isSoonerEvent(EventFileRef a, EventFileRef b, unsigned long currentEpoch)
{
  bool aRunsForever = a.startDateTimeEpoch >= a.finishDateTimeEpoch;
  bool bRunsForever = b.startDateTimeEpoch >= b.finishDateTimeEpoch;
  bool aStartedInThePast = a.startDateTimeEpoch <= currentEpoch;
  /*bool bStartedInThePast = b.startDateTimeEpoch <= currentEpoch; */
  bool aFinishedInThePast = (a.finishDateTimeEpoch <= currentEpoch) && !aRunsForever;
  bool bFinishedInThePast = (b.finishDateTimeEpoch <= currentEpoch) && !bRunsForever;

  if (aStartedInThePast)                                      /*a started in the past */
  {
    if (aFinishedInThePast)
    {
      return ( false);                                    /*a finished in the past so is disabled */
    }
    if (bFinishedInThePast)
    {
      return ( true);                                     /*b finished in the past so is disabled, and a is still running */
    }
    return (a.startDateTimeEpoch > b.startDateTimeEpoch);   /*if a started later than b then it is closer */
  }

  /*a starts in the future */
  if (bFinishedInThePast)
  {
    return ( true);                                     /*b finished in the past so is disabled, and a has yet to start */
  }
  return (a.startDateTimeEpoch < b.startDateTimeEpoch);   /*a will start sooner than b */
}

String Event::getTxDescriptiveName(String role_tx)          /* role_tx = "r:t" */
{
  String theName = "";
  int i = role_tx.indexOf(":");

  if (i < 1)
  {
    return ( String("Error(:)"));
  }

  int roleIndex = (role_tx.substring(0, i)).toInt();  /* r */
  int txIndex = (role_tx.substring(i + 1)).toInt();   /* t */

  //    if(debug_prints_enabled)
  //    {
  //    	Serial.println(String("role = " + String(roleIndex) + "; tx = " + String(txIndex)));
  //    }

  if (((roleIndex >= 0) && (roleIndex < this->eventData->event_number_of_tx_types)) && ((txIndex >= 0) && (txIndex < this->eventData->role[roleIndex]->numberOfTxs)))
  {
    int txsInRole = this->eventData->role[roleIndex]->numberOfTxs;

    theName = this->eventData->role[roleIndex]->rolename;

    if (txsInRole > 1)
    {
      theName = String(theName + " " + String(txIndex + 1));
    }

    theName = String(theName + " - " + this->eventData->role[roleIndex]->tx[txIndex]->pattern);
  }

  return (theName);
}

String Event::readMeFile(String path)
{
  if (path == NULL)
  {
    return ( "");
  }

