DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
  if (!path.startsWith("/"))
  {
    path = "/" + path;
  }

  if (path.endsWith(".event"))
  {
    int dot = path.lastIndexOf(".event");
    path = path.substring(0, dot);
  }

  if (!path.endsWith(".me"))
  {
    path = path + ".me";
  }

  if (LittleFS.exists(path))
  {
    /* Create an object to hold the file data */
    File file = LittleFS.open(path, "r"); /* Open the file for reading */

    if (file)
    {
      yield();
      String s = file.readStringUntil('\n');
      int count = 0;

      while (s.length() && count++ < MAXIMUM_NUMBER_OF_ME_FILE_LINES)
      {
        this->parseStringData(s);
        s = file.readStringUntil('\n');
      }

      file.close();   /* Close the file */
    }
  }
  else
  {
    File file = LittleFS.open(path, "w"); /* Open the file for writing */

    if (file)
    {
      file.println(TX_ASSIGNMENT + String(",0:0"));
      file.println(String(TX_DESCRIPTIVE_NAME) + "," + getTxDescriptiveName("0:0"));
//      file.println(String(TX_ROLE_POWER) + "," + String(this->getPowerlevelForRole(0)));
//      file.println(String(TX_ROLE_FREQ) + "," + String(this->getFrequencyForRole(0)));
      file.println(TX_ASSIGNMENT_IS_DEFAULT + String(",true"));
      file.close();   /* Close the file */
    }

    //		if(debug_prints_enabled)
    //		{
    //			Serial.println(String("\tWrote file: ") + path);
    //		}

    this->eventData->tx_assignment = "0:0";
    this->eventData->tx_assignment_is_default = true;
  }

  return ( path);
}

bool Event::extractMeFileData(String path, EventFileRef *eventRef)
{
  bool fail = true;

  if (path == NULL)
  {
    return ( fail);
  }

  if (!path.startsWith("/"))
  {
    path = "/" + path;
  }

  if (path.endsWith(".event"))
  {
    int dot = path.lastIndexOf(".event");
    path = path.substring(0, dot);
  }

  if (!path.endsWith(".me"))
  {
    path = path + ".me";
  }

  if (LittleFS.exists(path))
  {
    /* Create an object to hold the file data */
    File file = LittleFS.open(path, "r"); /* Open the file for reading */

    if (file)
    {
      yield();
      String s = file.readStringUntil('\n');
      int count = 0;
      int items = 0;

      EventLineData data;

      while (s.length() && (items < 4) && (count++ < MAXIMUM_NUMBER_OF_ME_FILE_LINES))
      {
        Event::extractLineData(s, &data);

        if (data.id.equalsIgnoreCase(TX_DESCRIPTIVE_NAME))
        {
          eventRef->role = data.value;
          fail = false;
          items++;
        }
//        else if (data.id.equalsIgnoreCase(TX_ROLE_FREQ))
//        {
//          eventRef->freq = data.value;
//          fail = false;
//          items++;
//        }
//        else if (data.id.equalsIgnoreCase(TX_ROLE_POWER))
//        {
//          eventRef->power = data.value;
//          fail = false;
//          items++;
//        }
        /* ignore TX_ASSIGNMENT "TX_ASSIGNMENT" / *Which role and time slot is assigned to this transmitter: "r:t" * / */

        yield();
        s = file.readStringUntil('\n');
      }

      file.close();   /* Close the file */
    }
  }
  else
  {
    File file = LittleFS.open(path, "w"); /* Open the file for writing */

    if (file)
    {
      file.println(TX_ASSIGNMENT + String(",0:0"));
      file.println(String(TX_DESCRIPTIVE_NAME) + ",Finish - MO");
//      file.println(String(TX_ROLE_POWER) + ",1000");
//      file.println(String(TX_ROLE_FREQ) + ",3550000");
      file.println(TX_ASSIGNMENT_IS_DEFAULT + String(",true"));
      file.close();   /* Close the file */
    }

    eventRef->role = "?";
    eventRef->freq = "?";
    fail = false;
  }

  return ( fail);
}

bool Event::validEventFile(String path)
{
  bool isValid;
  isValid = validEventFile(path, NULL);
  return (isValid);
}

bool Event::validEventFile(String path, String* filename)
{
  bool failure = false;
  bool startFound = false;
  bool endFound = false;
  int linesInFile = 0;
  EventLineData lineData;
  int checksum;

  if (!path.startsWith("/"))
  {
    path = "/" + path;
  }

  if (LittleFS.exists(path))
  {
    /* Create an object to hold the file data */
    File file = LittleFS.open(path, "r"); /* Open the file for reading */

    if (file)
    {
      String s = String("START");

      while (s.length() && !startFound)
      {
        yield();
        s = file.readStringUntil('\n');
        s.trim();

        if (!extractLineData(s, &lineData))
        {
          startFound = s.equals(EVENT_FILE_START);
          if (lineData.id.equals(EVENT_FILE_NAME))
          {
            if (filename)
            {
              *filename = lineData.value;
            }
          }
        }
      }

      if (startFound)
      {
        linesInFile = 1;
        checksum += s.length(); /* Add length of EVENT_START */

        while (s.length() && (linesInFile++ <= MAXIMUM_NUMBER_OF_EVENT_FILE_LINES) && !endFound)
        {
          yield();
          s = file.readStringUntil('\n');
          s.trim();
          if (!endFound)
          {
            checksum += s.length();
            endFound = s.equals(EVENT_FILE_END);
          }
          else if (!extractLineData(s, &lineData))
          {
            if (lineData.id.equals(EVENT_FILE_CHECKSUM))
            {
              failure = (checksum != lineData.value.toInt());
            }
          }

          linesInFile++;
        }

        if (!failure)
        {
          failure = (!endFound || (linesInFile > MAXIMUM_NUMBER_OF_EVENT_FILE_LINES));
        }
      }
      else
      {
        failure = true;
      }

      file.close();   /* Close the file */
    }
    else
    {
      failure = true;
    }
  }
  else
  {
    failure = true;
  }

  return (!failure);
}

bool Event::readEventFile(String path)
{
  bool failure = false;
  bool startFound = false;
  bool endFound = false;
  int linesInFile = 0;

  if (!path.startsWith("/"))
  {
    path = "/" + path;
  }

  if (LittleFS.exists(path))
  {
    this->eventData->tx_assignment = "";
    this->eventData->tx_assignment_is_default = "";
    this->eventData->event_file_version = "";
    this->eventData->event_band = "";
    this->eventData->event_antenna_port = "";
    this->eventData->event_callsign = "";
    this->eventData->event_callsign_speed = "";
    this->eventData->event_start_date_time = "";
    this->eventData->event_finish_date_time = "";
    this->eventData->event_modulation = "";
    this->eventData->event_number_of_tx_types = -1;
    this->myPath = path;

    /* Create an object to hold the file data */
    File file = LittleFS.open(path, "r"); /* Open the file for reading */

