DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
    if (file)
    {
      String s = String("START");

      while (s.length() && !startFound)
      {
        yield();
        s = file.readStringUntil('\n');
        s.trim();
        startFound = s.equals(EVENT_FILE_START);
      }

      if (startFound)
      {
        linesInFile = 1;

        while (s.length() && (linesInFile++ <= MAXIMUM_NUMBER_OF_EVENT_FILE_LINES) && !endFound)
        {
          yield();
          s = file.readStringUntil('\n');
          s.trim();
          this->parseStringData(s);
          endFound = s.equals(EVENT_FILE_END);
          linesInFile++;
        }

        failure = (!endFound || (linesInFile > MAXIMUM_NUMBER_OF_EVENT_FILE_LINES));
      }
      else
      {
        failure = true;
      }

      file.close();   /* Close the file */
    }
    else
    {
      failure = true;
    }

    getTxAssignment();
    values_did_change = false;
  }
  else
  {
    failure = true;
  }

  return ( failure);
}

void Event::dumpData(void)
{
  if (eventData == NULL)
  {
    return;
  }

  Serial.println("=====");
  Serial.println("Event name: " + eventData->event_name);
  Serial.println("File ver: " + eventData->event_file_version);
  Serial.println("Band: " + eventData->event_band);
  Serial.println("Call: " + eventData->event_callsign);
  Serial.println("Start: " + eventData->event_start_date_time);
  Serial.println("Finish: " + eventData->event_finish_date_time);
  Serial.println("Mod: " + eventData->event_modulation);
  Serial.println("Types: " + String(eventData->event_number_of_tx_types));
  for (int i = 0; i < eventData->event_number_of_tx_types; i++)
  {
    Serial.println("  Name: " + eventData->role[i]->rolename);
    Serial.println("    No. txs: " + String(eventData->role[i]->numberOfTxs));
    Serial.println("    Freq: " + String(eventData->role[i]->frequency));
    Serial.println("    Pwr: " + String(eventData->role[i]->powerLevel_mW));
    Serial.println("    WPM: " + String(eventData->role[i]->code_speed));
    Serial.println("    ID int: " + String(eventData->role[i]->id_interval));

    for (int j = 0; j < eventData->role[i]->numberOfTxs; j++)
    {
      Serial.println("      Pattern: " + eventData->role[i]->tx[j]->pattern);
      Serial.println("      onTime: " + eventData->role[i]->tx[j]->onTime);
      Serial.println("      offTime: " + eventData->role[i]->tx[j]->offTime);
      Serial.println("      delayTime: " + eventData->role[i]->tx[j]->delayTime);
    }
  }
  Serial.println("=====");
}

/**
   Returns TRUE if this event contains valid data
*/
bool Event::validateEvent(void)
{
  bool success;

  success = (this->eventData != NULL);

  if (success)
  {
    success &= (this->eventData->event_name).length() > 0;
    success &= (this->eventData->event_file_version).length() > 0;
    success &= (this->eventData->event_band).length() > 0;
    /*success &= (this->eventData->event_antenna_port); */
    success &= (this->eventData->event_callsign).length() > 2;
    success &= (this->eventData->event_callsign_speed).length() > 0;
    success &= (this->eventData->event_start_date_time).length() > 19;
    success &= (this->eventData->event_finish_date_time).length() > 19;
    success &= (this->eventData->event_modulation).length() > 0;
    success &= ((this->eventData->event_number_of_tx_types) > 0);

    for (int i = 0; i < this->eventData->event_number_of_tx_types; i++)
    {
      success &= (this->eventData->role[i]->rolename).length() > 0;
      success &= (this->eventData->role[i]->numberOfTxs) > 0;
      success &= (this->eventData->role[i]->frequency) > 0;
      success &= (this->eventData->role[i]->powerLevel_mW) > 0;
      success &= (this->eventData->role[i]->code_speed) > 0;
      /*success &= (this->eventData->role[i]->id_interval); */

      for (int j = 0; j < this->eventData->role[i]->numberOfTxs; j++)
      {
        success &= (this->eventData->role[i]->tx[j]->pattern).length() > 0;
        success &= (this->eventData->role[i]->tx[j]->onTime).length() > 0;
        success &= (this->eventData->role[i]->tx[j]->offTime).length() > 0;
        success &= (this->eventData->role[i]->tx[j]->delayTime).length() > 0;
      }
    }
  }

  return ( success);
}

bool Event::writeEventFile(void)
{
  return (this->writeEventFile(this->myPath));
}

bool Event::writeEventFile(String path)
{
  bool failure = true;

  if (this->eventData == NULL)
  {
    return ( true);
  }

  if (!validateEvent())
  {
    return ( true);
  }

  if (this->values_did_change == false)
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.print("Not written: Event did not change.");
      Serial.println(path);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    return ( false); /*nothing new to save, return no error */
  }
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  else if (debug_prints_enabled)
  {
    Serial.print("Writing Event changes to:");
    Serial.println(path);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  if (path == NULL)
  {
    path = this->myPath;
  }

  if (!path.startsWith("/"))
  {
    path = "/" + path;
  }
  /*  if (LittleFS.exists(path)) {      // version of that file must be deleted (if it exists) */
  /*    LittleFS.remove(path); */
  /*  } */

#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.print("Writing file: ");
    Serial.println(path);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  noInterrupts();

  File eventFile = LittleFS.open(path, "w");    /* Open the file for writing in LittleFS (create if it doesn't exist) */

  this->myPath = path;

  String typenum, txnum;

  if (eventFile)
  {
    eventFile.println(EVENT_FILE_START);
    eventFile.println(String(String(EVENT_NAME) + "," + this->eventData->event_name));
    eventFile.println(String(String(EVENT_FILE_VERSION) + "," + this->eventData->event_file_version));
    eventFile.println(String(String(EVENT_BAND) + "," + this->eventData->event_band));
    eventFile.println(String(String(EVENT_ANTENNA_PORT) + "," + this->eventData->event_antenna_port));
    eventFile.println(String(String(EVENT_CALLSIGN) + "," + this->eventData->event_callsign));
    eventFile.println(String(String(EVENT_CALLSIGN_SPEED) + "," + this->eventData->event_callsign_speed));
    eventFile.println(String(String(EVENT_START_DATE_TIME) + "," + this->eventData->event_start_date_time));
    eventFile.println(String(String(EVENT_FINISH_DATE_TIME) + "," + this->eventData->event_finish_date_time));
    eventFile.println(String(String(EVENT_MODULATION) + "," + this->eventData->event_modulation));
    eventFile.println(String(String(EVENT_NUMBER_OF_TX_TYPES) + "," + this->eventData->event_number_of_tx_types));

