DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
    for (int i = 0; i < this->eventData->event_number_of_tx_types; i++)
    {
      typenum = String("TYPE" + String(i + 1));
      eventFile.println(String(typenum + TYPE_NAME + "," + this->eventData->role[i]->rolename));
      eventFile.println(String(typenum + TYPE_TX_COUNT + "," + String(this->eventData->role[i]->numberOfTxs)));
      eventFile.println(String(typenum + TYPE_FREQ + "," + String(this->eventData->role[i]->frequency)));
      eventFile.println(String(typenum + TYPE_POWER_LEVEL + "," + String(this->eventData->role[i]->powerLevel_mW)));
      eventFile.println(String(typenum + TYPE_CODE_SPEED + "," + String(this->eventData->role[i]->code_speed)));
      eventFile.println(String(typenum + TYPE_ID_INTERVAL + "," + String(this->eventData->role[i]->id_interval)));

      for (int j = 0; j < this->eventData->role[i]->numberOfTxs; j++)
      {
        txnum = String("TX" + String(j + 1));
        eventFile.println(String(typenum + "_" + txnum + TYPE_TX_PATTERN + "," + this->eventData->role[i]->tx[j]->pattern));
        eventFile.println(String(typenum + "_" + txnum + TYPE_TX_ON_TIME + "," + this->eventData->role[i]->tx[j]->onTime));
        eventFile.println(String(typenum + "_" + txnum + TYPE_TX_OFF_TIME + "," + this->eventData->role[i]->tx[j]->offTime));
        eventFile.println(String(typenum + "_" + txnum + TYPE_TX_DELAY_TIME + "," + this->eventData->role[i]->tx[j]->delayTime));
      }
    }

    eventFile.println(EVENT_FILE_END);
    eventFile.close();  /* Close the file */
  }
  else
  {
    interrupts();
    return ( true);
  }
  interrupts();

  saveMeData("");

  failure = !validEventFile(path);

  return ( failure);
}

void Event::saveMeData(String newAssignment)
{
  if (this->eventData == NULL)
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if ( debug_prints_enabled )
    {
      Serial.println("Me not saved: no event data");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    return;
  }

  if ((this->eventData->tx_assignment.length() < 3) || (this->eventData->tx_assignment.indexOf(":") < 1))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if ( debug_prints_enabled )
    {
      Serial.println("Me not saved: assignment error");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    return;
  }

  if (this->myPath.length() < 7)
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if ( debug_prints_enabled )
    {
      Serial.println("Me not saved: path error");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    return;
  }

  String holdTxAssignment;
  String holdRoleName = this->eventData->tx_role_name;
//  String holdRoleFrequency = this->eventData->tx_role_freq;

  if (newAssignment.indexOf(":") < 1)
  {
    holdTxAssignment = this->eventData->tx_assignment;
  }
  else
  {
    holdTxAssignment = newAssignment;
  }

  String path = readMeFile(this->myPath); /* reads file value into this->eventData->tx_assignment, and returns the path to the Me file */

  if ((!holdTxAssignment.equals(this->eventData->tx_assignment)) || (!holdRoleName.equals(this->eventData->tx_role_name)))
  {
    String role = holdTxAssignment.substring(0, holdTxAssignment.indexOf(":"));
    File file = LittleFS.open(path, "w"); /* Open the file for writing */

    if (file)
    {
      file.println(EVENT_FILE_START);
      file.println(String(TX_ASSIGNMENT) + "," + holdTxAssignment);
      file.println(String(TX_DESCRIPTIVE_NAME) + "," + getTxDescriptiveName(holdTxAssignment));
//      file.println(String(TX_ROLE_POWER) + "," + String(this->getPowerlevelForRole(role.toInt())));
//      file.println(String(TX_ROLE_FREQ) + "," + String(this->getFrequencyForRole(role.toInt())));
      file.println(String(TX_ASSIGNMENT_IS_DEFAULT) + ",false");
      file.println(EVENT_FILE_END);
      file.close();   /* Close the file */

#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if ( debug_prints_enabled )
      {
        Serial.println(String("Me file written: ") + path);
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }

  this->eventData->tx_assignment = holdTxAssignment;  /* set tx_assignment to the latest value */
}

/*/////////////////////////////////////////////////////////////////////////////////////// */

bool Event::setTxAssignment(String role_slot)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  role_slot.trim();
  int c = role_slot.indexOf(':');
  if (c < 1)
  {
    return ( true);
  }

  if (this->eventData->tx_assignment != role_slot)
  {
    String r = role_slot.substring(0, c - 1);
    this->eventData->tx_assignment = role_slot;
    this->eventData->tx_role_name = Event::getTxDescriptiveName(role_slot);
    this->eventData->tx_role_pwr = Event::getPowerlevelForRole(r.toInt());
    this->eventData->tx_role_freq = Event::getFrequencyForRole(r.toInt());
    this->values_did_change = true;

#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Set role: " + this->eventData->tx_assignment);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
  }

  return ( false);
}

String Event::getTxAssignment(void)
{
  if ((this->eventData->tx_assignment.length() < 1) || (this->eventData->tx_assignment.indexOf(":") < 1))
  {
    readMeFile(this->myPath);
  }

  return ( this->eventData->tx_assignment);
}

bool Event::setTxFrequency(String frequency)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (frequency == NULL)
  {
    return ( true);
  }

  if (!frequency.equals(this->eventData->tx_role_freq))
  {
    this->eventData->tx_role_freq = frequency;
    this->values_did_change = true;

#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Set frequency: " + this->eventData->tx_role_freq);
    }
#endif // #if TRANSMITTER_COMPILE_DEBUG_PRINTS
  }

  return ( false);
}

String Event::getTxFrequency(void)
{
  if ((this->eventData->tx_assignment.length() < 1) || (this->eventData->tx_assignment.indexOf(":") < 1))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Reading ME file...");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    readMeFile(this->myPath);
  }

  return ( this->eventData->tx_role_freq);
}

int Event::getTxRoleIndex(void)
{
  int result = -1;
  String assign = this->eventData->tx_assignment;

  if (assign.indexOf(":") < 1)
  {
    getTxAssignment();
  }
  int colon = assign.indexOf(":");
  if (colon < 1)
  {
    return ( result);
  }
  result = (assign.substring(0, colon)).toInt();  /* r */
  return ( result);
}

int Event::getTxSlotIndex(void)
{
  int result = -1;
  String assign = this->eventData->tx_assignment;

  if (assign.indexOf(":") < 1)
  {
    getTxAssignment();
  }
  int colon = assign.indexOf(":");
  if (colon < 1)
  {
    return ( result);
  }
  result = (assign.substring(colon + 1)).toInt(); /* t */
  return ( result);
}

