DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
TxDataType *Event::getTxData(int roleIndex, int txIndex)
{
  return ( eventData->role[roleIndex]->tx[txIndex]);
}

void Event::setEventName(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_name != str)
  {
    this->setEventData(EVENT_NAME, str);
    this->values_did_change = true;
  }
}

String Event::getEventName(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_name);
}

void Event::setEventFileVersion(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_file_version != str)
  {
    this->setEventData(EVENT_FILE_VERSION, str);
    this->values_did_change = true;
  }
}

String Event::getEventFileVersion(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_file_version);
}

void Event::setEventBand(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_band != str)
  {
    this->setEventData(EVENT_BAND, str);
    this->values_did_change = true;
  }
}

String Event::getEventBand(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_band);
}

void Event::setCallsign(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_callsign != str)
  {
    this->setEventData(EVENT_CALLSIGN, str);
    this->values_did_change = true;
  }
}

String Event::getCallsign(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_callsign);
}

void Event::setAntennaPort(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_antenna_port != str)
  {
    this->setEventData(EVENT_ANTENNA_PORT, str);
    this->values_did_change = true;
  }
}

String Event::getAntennaPort(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_antenna_port);
}

void Event::setCallsignSpeed(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_callsign_speed != str)
  {
    this->setEventData(EVENT_CALLSIGN_SPEED, str);
    this->values_did_change = true;
  }
}

String Event::getCallsignSpeed(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_callsign_speed);
}

void Event::setEventStartDateTime(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  /* Lop off milliseconds if they exist */
  if ((str.length() > 20) && (str.lastIndexOf('.') > 0))
  {
    int index = str.lastIndexOf('.');
    str = str.substring(0, index);
    str = str + "Z";
  }

  /* Add seconds if they are missing */
  if (str.lastIndexOf(':') == str.indexOf(':'))   /* if time contains only one ':' */
  {
    int index = str.lastIndexOf(':') + 3;
    str = str.substring(0, index);
    str = str + ":00Z";
  }

  if (!(this->eventData->event_start_date_time.equals(str)))
  {
    this->setEventData(EVENT_START_DATE_TIME, str);
    this->values_did_change = true;
  }
}

String Event::getEventStartDateTime(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_start_date_time);
}

void Event::setEventFinishDateTime(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  /* Lop off milliseconds if they exist */
  if ((str.length() > 20) && (str.lastIndexOf('.') > 0))
  {
    int index = str.lastIndexOf('.');
    str = str.substring(0, index);
    str = str + "Z";
  }

  /* Add seconds if they are missing */
  if (str.lastIndexOf(':') == str.indexOf(':'))   /* if time contains only one ':' */
  {
    int index = str.lastIndexOf(':') + 3;
    str = str.substring(0, index);
    str = str + ":00Z";
  }

  if (!(this->eventData->event_finish_date_time.equals(str)))
  {
    this->setEventData(EVENT_FINISH_DATE_TIME, str);
    this->values_did_change = true;
  }
}

String Event::getEventFinishDateTime(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_finish_date_time);
}

void Event::setEventModulation(String str)
{
  if (this->eventData == NULL)
  {
    return;
  }
  str.trim();

  if (this->eventData->event_modulation != str)
  {
    this->setEventData(EVENT_MODULATION, str);
    this->values_did_change = true;
  }
}

String Event::getEventModulation(void) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  return ( this->eventData->event_modulation);
}

void Event::setEventNumberOfTxTypes(int val)
{
  if (this->eventData == NULL)
  {
    return;
  }

  if (this->eventData->event_number_of_tx_types != val)
  {
    this->setEventData(EVENT_NUMBER_OF_TX_TYPES, val);
    this->values_did_change = true;
  }
}

void Event::setEventNumberOfTxTypes(String str)
{
  this->setEventNumberOfTxTypes(str.toInt());
  this->values_did_change = true;
}

int Event::getEventNumberOfTxTypes(void) const
{
  if (this->eventData == NULL)
  {
    return ( -1);
  }
  return ( this->eventData->event_number_of_tx_types);
}

bool Event::setRolename(int roleIndex, String str)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (roleIndex < 0)
  {
    return ( true);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }
  this->eventData->role[roleIndex]->rolename = str;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println("Type" + String(roleIndex) + " role: " + str);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  this->values_did_change = true;
  return ( false);
}

String Event::getRolename(int roleIndex) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  if (roleIndex < 0)
  {
    return ( "");
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( "");
  }
  return ( this->eventData->role[roleIndex]->rolename);
}

bool Event::setNumberOfTxsForRole(int roleIndex, String str)
{
  int num = str.toInt();

