DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
  if (num < 1)
  {
    return ( true);
  }
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (roleIndex < 0)
  {
    return ( true);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }

  this->eventData->role[roleIndex]->numberOfTxs = num;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println("Type" + String(roleIndex) + " No Txs: " + str);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  this->values_did_change = true;
  return ( false);
}

int Event::getNumberOfTxsForRole(int roleIndex) const
{
  if (this->eventData == NULL)
  {
    return ( -1);
  }
  if (roleIndex < 0)
  {
    return ( -1);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( -1);
  }
  return ( this->eventData->role[roleIndex]->numberOfTxs);
}

bool Event::setFrequencyForRole(int roleIndex, long freq)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (roleIndex < 0)
  {
    return ( true);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }
  this->eventData->role[roleIndex]->frequency = freq;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println("Type" + String(roleIndex) + " freq: " + String(freq));
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  this->values_did_change = true;

  /*If the transmitter is currently set to this role then update its frequency too */
  if (roleIndex == this->getTxRoleIndex())
  {
    this->setTxFrequency(String(freq));
  }
  return ( false);
}

long Event::getFrequencyForRole(int roleIndex) const
{
  if (this->eventData == NULL)
  {
    return ( -1);
  }
  if (roleIndex < 0)
  {
    return ( -1);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( -1);
  }
  return ( this->eventData->role[roleIndex]->frequency);
}

bool Event::setPowerlevelForRole(int roleIndex, String str)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (roleIndex < 0)
  {
    return ( true);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }
  this->eventData->role[roleIndex]->powerLevel_mW = str.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println("Type" + String(roleIndex) + " freq: " + str);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  this->values_did_change = true;
  return ( false);
}

int Event::getPowerlevelForRole(int roleIndex) const
{
  if (this->eventData == NULL)
  {
    return ( -1);
  }
  if (roleIndex < 0)
  {
    return ( -1);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( -1);
  }
  return ( this->eventData->role[roleIndex]->powerLevel_mW);
}

bool Event::setCodeSpeedForRole(int roleIndex, String str)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (roleIndex < 0)
  {
    return ( true);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }
  this->eventData->role[roleIndex]->code_speed = str.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println("Type" + String(roleIndex) + " freq: " + str);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  this->values_did_change = true;
  return ( false);
}

int Event::getCodeSpeedForRole(int roleIndex) const
{
  if (this->eventData == NULL)
  {
    return ( -1);
  }
  if (roleIndex < 0)
  {
    return ( -1);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( -1);
  }
  return ( this->eventData->role[roleIndex]->code_speed);
}

bool Event::setPatternForTx(int typeIndex, int txIndex, String str)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (typeIndex < 0)
  {
    return ( true);
  }
  if (typeIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }
  if (txIndex >= this->eventData->role[typeIndex]->numberOfTxs)
  {
    return ( true);
  }
  this->eventData->role[typeIndex]->tx[txIndex]->pattern = str;
  this->values_did_change = true;
  return ( false);
}

String Event::getPatternForTx(int roleIndex, int txIndex) const
{
  if (this->eventData == NULL)
  {
    return ( "");
  }
  if (roleIndex < 0)
  {
    return ( "");
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( "");
  }
  if (txIndex >= this->eventData->role[roleIndex]->numberOfTxs)
  {
    return ( "");
  }
  return ( this->eventData->role[roleIndex]->tx[txIndex]->pattern);
}

bool Event::setIDIntervalForRole(int roleIndex, String str)
{
  if (this->eventData == NULL)
  {
    return ( true);
  }
  if (roleIndex < 0)
  {
    return ( true);
  }
  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
    return ( true);
  }
  this->eventData->role[roleIndex]->id_interval = str.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
  if (debug_prints_enabled)
  {
    Serial.println("Type" + String(roleIndex) + " freq: " + str);
  }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

  this->values_did_change = true;
  return ( false);
}

int Event::getIDIntervalForRole(int roleIndex) const
{
  if (this->eventData == NULL)
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event data null");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    return ( -1);
  }

  if (roleIndex < 0)
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println(String("Roleindex invalid < :") + roleIndex);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    return ( -1);
  }

  if (roleIndex >= this->eventData->event_number_of_tx_types)
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println(String("Roleindex invalid > :") + roleIndex + ">=" + this->eventData->event_number_of_tx_types);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    return ( -1);
  }

  return ( this->eventData->role[roleIndex]->id_interval);
}

