DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
/*/////////////////////////////////////////////////////////////////////////////////// */

bool Event::setEventData(String id, int value)
{
  return ( this->setEventData(id, String(value)));
}

bool Event::setEventData(String id, String value)
{
  bool result = false;
  static String typeIndexStr = "";
  static int typeIndex = 0;
  static String txIndexStr = "";
  static int txIndex = 0;

  if (id.equalsIgnoreCase(TX_ASSIGNMENT))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Tx assignment: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    this->eventData->tx_assignment = value;
  }
  else if (id.equalsIgnoreCase(TX_DESCRIPTIVE_NAME))
  {
    this->eventData->tx_role_name = value;
  }
//  else if (id.equalsIgnoreCase(TX_ROLE_POWER))
//  {
//    this->eventData->tx_role_pwr = value;
//  }
//  else if (id.equalsIgnoreCase(TX_ROLE_FREQ))
//  {
//    this->eventData->tx_role_freq = value;
//  }
  else if (id.equalsIgnoreCase(TX_ASSIGNMENT_IS_DEFAULT))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Tx is default: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    if (value.equalsIgnoreCase("TRUE") || value.equals("1"))
    {
      this->eventData->tx_assignment_is_default = true;
    }
    else
    {
      this->eventData->tx_assignment_is_default = false;
    }
  }
  else if (id.equalsIgnoreCase(EVENT_NAME))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Set event_name: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_name = value;
  }
  else if (id.equalsIgnoreCase(EVENT_FILE_VERSION))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("File ver: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_file_version = value;
  }
  else if (id.equalsIgnoreCase(EVENT_BAND))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event band: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_band = value;
  }
  else if (id.equalsIgnoreCase(EVENT_CALLSIGN))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event callsign: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_callsign = value;
  }
  else if (id.equalsIgnoreCase(EVENT_ANTENNA_PORT))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event antenna: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_antenna_port = value;
  }
  else if (id.equalsIgnoreCase(EVENT_CALLSIGN_SPEED))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event ID speed: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_callsign_speed = value;
  }
  else if (id.equalsIgnoreCase(EVENT_START_DATE_TIME))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event start: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_start_date_time = value;
  }
  else if (id.equalsIgnoreCase(EVENT_FINISH_DATE_TIME))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event finish: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_finish_date_time = value;
  }
  else if (id.equalsIgnoreCase(EVENT_MODULATION))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event modulation: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_modulation = value;
  }
  else if (id.equalsIgnoreCase(EVENT_NUMBER_OF_TX_TYPES))
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Event tx types: " + value);
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    this->eventData->event_number_of_tx_types = value.toInt();
  }
  else if (id.endsWith(TYPE_TX_COUNT))
  {
    typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
    typeIndex = typeIndexStr.toInt() - 1;
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      this->eventData->role[typeIndex]->numberOfTxs = value.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if (debug_prints_enabled)
      {
        Serial.println("Type" + typeIndexStr + " count: " + value);
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }
  else if (id.endsWith(TYPE_NAME))
  {
    typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
    typeIndex = typeIndexStr.toInt() - 1;
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      this->eventData->role[typeIndex]->rolename = value;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if (debug_prints_enabled)
      {
        Serial.println("Type" + typeIndexStr + " role: " + value);
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }
  else if (id.endsWith(TYPE_FREQ))
  {
    typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
    typeIndex = typeIndexStr.toInt() - 1;
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      this->eventData->role[typeIndex]->frequency = value.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if (debug_prints_enabled)
      {
        Serial.println("Type" + typeIndexStr + " freq: " + value);
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }
  else if (id.endsWith(TYPE_POWER_LEVEL))
  {
    typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
    typeIndex = typeIndexStr.toInt() - 1;
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      this->eventData->role[typeIndex]->powerLevel_mW = value.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if (debug_prints_enabled)
      {
        Serial.println("Type" + typeIndexStr + " power: " + value + " mW");
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }
  else if (id.endsWith(TYPE_ID_INTERVAL))
  {
    typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
    typeIndex = typeIndexStr.toInt() - 1;
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      this->eventData->role[typeIndex]->id_interval = value.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if (debug_prints_enabled)
      {
        Serial.println("Type" + typeIndexStr + " ID interval: " + value + " sec");
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }
  else if (id.endsWith(TYPE_CODE_SPEED))
  {
    typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
    typeIndex = typeIndexStr.toInt() - 1;
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      this->eventData->role[typeIndex]->code_speed = value.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
      if (debug_prints_enabled)
      {
        Serial.println("Type" + typeIndexStr + " code speed: " + value + " WPM");
      }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
    }
  }
  else if (id.endsWith(TYPE_TX_PATTERN))
  {
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      int i = id.indexOf("TX") + 2;
      txIndexStr = id.substring(i, id.indexOf("_", i));
      txIndex = txIndexStr.toInt() - 1;

      if ((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
      {
        this->eventData->role[typeIndex]->tx[txIndex]->pattern = value;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
        if (debug_prints_enabled)
        {
          Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " pattern: " + value);
        }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
      }
    }
  }
  else if (id.endsWith(TYPE_TX_ON_TIME))
  {
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      int i = id.indexOf("TX") + 2;
      txIndexStr = id.substring(i, id.indexOf("_", i));
      txIndex = txIndexStr.toInt() - 1;

      if ((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
      {
        this->eventData->role[typeIndex]->tx[txIndex]->onTime = value;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
        if (debug_prints_enabled)
        {
          Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " on time: " + value + "sec");
        }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
      }
    }
  }
  else if (id.endsWith(TYPE_TX_OFF_TIME))
  {
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      int i = id.indexOf("TX") + 2;
      txIndexStr = id.substring(i, id.indexOf("_", i));
      txIndex = txIndexStr.toInt() - 1;

      if ((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
      {
        this->eventData->role[typeIndex]->tx[txIndex]->offTime = value.toInt();
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
        if (debug_prints_enabled)
        {
          Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " off time: " + value + "sec");
        }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
      }
    }
  }
  else if (id.endsWith(TYPE_TX_DELAY_TIME))
  {
    if ((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
    {
      int i = id.indexOf("TX") + 2;
      txIndexStr = id.substring(i, id.indexOf("_", i));
      txIndex = txIndexStr.toInt() - 1;

      if ((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
      {
        this->eventData->role[typeIndex]->tx[txIndex]->delayTime = value;
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
        if (debug_prints_enabled)
        {
          Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " delay time: " + value + "sec");
        }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS
      }
    }
  }
  else
  {
#if TRANSMITTER_COMPILE_DEBUG_PRINTS
    if (debug_prints_enabled)
    {
      Serial.println("Error in file: SettingID = " + id + " Value =[" + value + "]");
    }
#endif // TRANSMITTER_COMPILE_DEBUG_PRINTS

    result = true;
  }

  return ( result);
}
